occDrivAerStaticMesh/Allrun.coherent
#!/bin/bash -l
### Script for running the open-closed coolings DrivAer with a static mesh
### Original authors: Charles Mockett, Hendrik Hetmann and Felix Kramer (Upstream CFD GmbH), 2022-2023
### Modified setup for OpenFOAM HPC Challenge (OHC-1): Mark Wasserman (Huawei) and Sergey Lesnik (Wikki GmbH), 2025

# Based on the geometry and setup of the AutoCFD4 Workshop:
# Hupertz, B., Chalupa, K., Krueger, L., Howard, K., Glueck, H.-D., Lewington, N., . . . Shin, Y.-s. (2021). On the Aerodynamics of the Notchback Open Cooling DrivAer: A Detailed Investigation of Wind Tunnel Data for Improved Correlation and Reference. SAE Int. J. Adv. & Curr. Prac. in Mobility, 3(4), 1726-1747. doi:https://doi.org/10.4271/2021-01-0958

### example for slurm submission
# adapt to your needs or ignore if not submitting to a queuing system
#SBATCH --job-name "DrivAer_RANS"
#SBATCH --ntasks=512
#SBATCH --ntasks-per-node=128
#SBATCH --partition=arm
#SBATCH --output=%x-%j.out
#SBATCH --error=%x-%j.err

### Solver
solverRANS="simpleFoam"

### Used directories
logDir="logFiles"

### Misc
fvSolution=fvSolution.fixedIter # fvSolution.fixedTol
controlDict=controlDict.noWrite # controlDict.withWrite
fileHandler=" "                 # "-fileHandler hostCollated "

# function to read parameters from caseDefinition...
function getInputParam ()
{
    varVal=`grep -w ${1} system/include/caseDefinition | cut -d ";" -f 1 | grep -v '//'`
    varVal=`echo ${varVal:${#1}}`
    echo $varVal
}

# get input parameters
nProcs=`getInputParam nCores`
TIMESTAMP=$(date "+%Y-%m-%d_%H-%M-%S")

# copy controlDict/fvSolution files

cp system/${controlDict} system/controlDict
cp system/${fvSolution} system/fvSolution

# extra mpi flags
OMPI_FLAGS="" #  "--mca pml ucx"

parEx="mpirun -np ${nProcs} ${OMPI_FLAGS}"


. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions

# ---- initialise & run simulation
mkdir $logDir

# This step converts the mesh from the legacy to coherent format.
# Additionally, it decomposes the mesh using decomposeParDict and renumbers
# each partition.  Prerequisite: writeFormat in controlDict is NOT set to
# "coherent"
echo; echo "renumberMesh"
time renumberMesh -decompose -write-coherent -overwrite > $logDir/20_renumberMesh.log 2>&1 || exit 1

# After conversion, set the controlDict entries for testing coherent format
foamDictionary system/controlDict -entry endTime -set 4 -disableFunctionEntries
foamDictionary system/controlDict -entry writeInterval -set 2 -disableFunctionEntries
foamDictionary system/controlDict -entry writeFormat -set coherent -disableFunctionEntries

echo; echo "restore 0 Directory"
restore0Dir

# The format entry in all initial fields files needs to be coherent
echo; echo "change file format of fields in 0 directory to coherent"
sed -i 's/ascii/coherent/g' 0/*

echo; echo "potentialFoam"
time $parEx potentialFoam -initialiseUBCs -parallel $fileHandler > $logDir/30_potentialFoam.log 2>&1 || exit 1

echo; echo "applyBoundaryLayer"
time $parEx applyBoundaryLayer -ybl "0.0450244" -parallel $fileHandler > $logDir/40_applyBoundaryLayer.log 2>&1 || exit 1

echo; echo $solverRANS
time $parEx $solverRANS -parallel $fileHandler > $logDir/50_$solverRANS.$TIMESTAMP.log 2>&1 || exit 1

# Test restarting from a specific time
foamDictionary system/controlDict -entry startFrom -set startTime -disableFunctionEntries
foamDictionary system/controlDict -entry startTime -set 2 -disableFunctionEntries

echo; echo $solverRANS " restart from time 2"
time $parEx $solverRANS -parallel $fileHandler > $logDir/51_$solverRANS.$TIMESTAMP.log 2>&1 || exit 1

echo "... done!"
